//=============================================================
//
// モード管理 [mode_manager.cpp]
// Author: Ito Kotaro
//
//=============================================================
#include "mode_manager.h"

//=============================================================
// [ModeManager] 初期化
//=============================================================
void ModeManager::Init()
{
	if (m_mode != nullptr)
	{
		m_mode->Init();
	}
}

//=============================================================
// [ModeManager] 終了
//=============================================================
void ModeManager::Uninit()
{
	if (m_mode != nullptr)
	{
		m_mode->Uninit();
		m_mode->ResetState();
	}
}

//=============================================================
// [ModeManager] 更新
//=============================================================
void ModeManager::Update()
{
	if (m_mode != nullptr)
	{
		m_mode->Update();
	}
}

//=============================================================
// [ModeManager] 最後の終了
//=============================================================
void ModeManager::LastUninit()
{
	if (m_mode != nullptr)
	{
		delete m_mode;
		m_mode = nullptr;
	}
}

//=============================================================
// [ModeManager] モード設定
//=============================================================
void ModeManager::SetMode(ModeTemplate* mode)
{
	// 既にモードが設定されている場合は終了する
	if (m_mode != nullptr)
	{
		m_mode->Uninit();
		delete m_mode;
		m_mode = nullptr;
	}

	// 新しいモードを設定する
	m_mode = mode;
}